In [15]:
import pandas as pd

#dataframe from dictionary of lists:
data = {
    'name': ["Agrim","Ansh","Mamta"],
    'age': [19,20,40],
    'city':['noida','delhi','rampur']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

    name  age    city
0  Agrim   19   noida
1   Ansh   20   delhi
2  Mamta   40  rampur
<class 'pandas.core.frame.DataFrame'>

In [16]:
#dataframe from list of dictonaries:
data = [
    {'name':"Agrim",'age':19,'city':'Rampur'},
    {'name':"Ansh",'age':20,'city':'noida'},
    {'name':"mamta",'age':40,'city':'Delhi'},
]
df = pd.DataFrame(data)
df

    name  age    city
0  Agrim   19  Rampur
1   Ansh   20   noida
2  mamta   40   Delhi

In [17]:
import numpy as np
np.array(df)

array([['Agrim', 19, 'Rampur'],
       ['Ansh', 20, 'noida'],
       ['mamta', 40, 'Delhi']], dtype=object)

In [44]:
#reading csv file
csv_data= pd.read_csv('sales_data.csv')
# print(df.head(5))
# print(df)
print(csv_data.head(5))
print(csv_data.describe())

         Date   Product     Category  Quantity  Price  Total
0  2024-08-01  Widget A  Electronics        10   25.0  250.0
1  2024-08-01  Widget B   Home Goods         5   15.0   75.0
2  2024-08-02  Widget C  Electronics         7   30.0  210.0
3  2024-08-02  Widget D   Home Goods         3   20.0   60.0
4  2024-08-03  Widget E  Electronics        12   22.5  270.0
        Quantity      Price       Total
count  10.000000  10.000000   10.000000
mean    6.600000  21.925000  150.700000
std     3.204164   4.717064   84.985031
min     2.000000  15.000000   35.000000
25%     4.250000  18.812500   75.250000
50%     6.500000  21.250000  157.500000
75%     8.750000  24.750000  214.500000
max    12.000000  30.000000  270.000000

In [45]:
df

    name  age    city
0  Agrim   21  Rampur
1   Ansh   22   noida
2  mamta   42   Delhi

In [46]:
'''accessing data from dataframe'''
type(df['name'])#if i am accessing a single column it actually becomes a series
df['name'] 
df.loc[0] #gives first row
df.loc[0][0] #works with row
df.iloc[0][2] #works with indexs

C:\Users\agrim\AppData\Local\Temp\ipykernel_5156\2293142092.py:5: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0] #works with row
C:\Users\agrim\AppData\Local\Temp\ipykernel_5156\2293142092.py:6: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2] #works with indexs

'Rampur'

In [47]:
'''Accessing specified elements'''
df.at[1,'age'] #age ke 1st index pe jo value hai wo dedo
df.at[2,'name']

'mamta'

In [48]:
'''Accessing specified elements using "iat" '''
df.iat[2,2] #2 of row and 2 of column

'Delhi'

In [49]:
''' DATA MANIPULATION WITH DATAFRAME'''

#adding column:
df['Salary'] = [50000,60000,70000]
df

#remove column:
# df.drop('Salary') # gives error bcz by-default axis value is row
df.drop('Salary',axis=1,inplace=True) #permanently deleted 
df

    name  age    city
0  Agrim   21  Rampur
1   Ansh   22   noida
2  mamta   42   Delhi

In [50]:
#increasing age
df['age'] = df['age']+1
df

    name  age    city
0  Agrim   22  Rampur
1   Ansh   23   noida
2  mamta   43   Delhi